sevenchau/ONENET-ESP8266/hal_bsp/bsp_STMB997/bsp.h
/*
*********************************************************************************************************
*                                             PERIPH DEFINES
*********************************************************************************************************
*/
                                                                /* -                  AHB1 BUS                        - */
#define  BSP_PERIPH_ID_GPIOA                               0u
#define  BSP_PERIPH_ID_GPIOB                               1u
#define  BSP_PERIPH_ID_GPIOC                               2u
#define  BSP_PERIPH_ID_GPIOD                               3u
#define  BSP_PERIPH_ID_GPIOE                               4u
#define  BSP_PERIPH_ID_GPIOF                               5u
#define  BSP_PERIPH_ID_GPIOG                               6u
#define  BSP_PERIPH_ID_GPIOH                               7u
#define  BSP_PERIPH_ID_GPIOI                               8u
#define  BSP_PERIPH_ID_GPIOJ                               9u
#define  BSP_PERIPH_ID_GPIOK                              10u
#define  BSP_PERIPH_ID_CRC                                12u
#define  BSP_PERIPH_ID_BKPSRAM                            18u
#define  BSP_PERIPH_ID_CCMDATARAM                         20u
#define  BSP_PERIPH_ID_DMA1                               21u
#define  BSP_PERIPH_ID_DMA2                               22u
#define  BSP_PERIPH_ID_DMA2D                              23u
#define  BSP_PERIPH_ID_ETHMAC                             25u
#define  BSP_PERIPH_ID_ETHMACTX                           26u
#define  BSP_PERIPH_ID_ETHMACRX                           27u
#define  BSP_PERIPH_ID_ETHMACPTP                          28u
#define  BSP_PERIPH_ID_OTGHS                              29u
#define  BSP_PERIPH_ID_OTGHSULPI                          30u
                                                                /* -                  AHB2 BUS                        - */
#define  BSP_PERIPH_ID_DCMI                               32u
#define  BSP_PERIPH_ID_CRYP                               36u
#define  BSP_PERIPH_ID_HASH                               37u
#define  BSP_PERIPH_ID_RNG                                38u
#define  BSP_PERIPH_ID_OTGFS                              39u
                                                                /* -                  AHB3 BUS                        - */
#define  BSP_PERIPH_ID_FSMC                               64u
                                                                /* -                  APB1 BUS                        - */
#define  BSP_PERIPH_ID_TIM2                               96u
#define  BSP_PERIPH_ID_TIM3                               97u
#define  BSP_PERIPH_ID_TIM4                               98u
#define  BSP_PERIPH_ID_TIM5                               99u
#define  BSP_PERIPH_ID_TIM6                              100u
#define  BSP_PERIPH_ID_TIM7                              101u
#define  BSP_PERIPH_ID_TIM12                             102u
#define  BSP_PERIPH_ID_TIM13                             103u
#define  BSP_PERIPH_ID_TIM14                             104u
#define  BSP_PERIPH_ID_WWDG                              107u
#define  BSP_PERIPH_ID_SPI2                              110u
#define  BSP_PERIPH_ID_SPI3                              111u
#define  BSP_PERIPH_ID_USART2                            113u
#define  BSP_PERIPH_ID_USART3                            114u
#define  BSP_PERIPH_ID_UART4                             115u
#define  BSP_PERIPH_ID_UART5                             116u
#define  BSP_PERIPH_ID_I2C1                              117u
#define  BSP_PERIPH_ID_I2C2                              118u
#define  BSP_PERIPH_ID_I2C3                              119u
#define  BSP_PERIPH_ID_CAN1                              121u
#define  BSP_PERIPH_ID_CAN2                              122u
#define  BSP_PERIPH_ID_PWR                               124u
#define  BSP_PERIPH_ID_DAC                               125u
#define  BSP_PERIPH_ID_UART7                             126u
#define  BSP_PERIPH_ID_UART8                             127u
                                                                /* -                  APB2 BUS                        - */
#define  BSP_PERIPH_ID_TIM1                              128u
#define  BSP_PERIPH_ID_TIM8                              129u
#define  BSP_PERIPH_ID_USART1                            132u
#define  BSP_PERIPH_ID_USART6                            133u
#define  BSP_PERIPH_ID_ADC1                              136u
#define  BSP_PERIPH_ID_ADC2                              137u
#define  BSP_PERIPH_ID_ADC3                              138u
#define  BSP_PERIPH_ID_SDIO                              139u
#define  BSP_PERIPH_ID_SPI1                              140u
#define  BSP_PERIPH_ID_SPI4                              141u
#define  BSP_PERIPH_ID_SYSCFG                            142u
#define  BSP_PERIPH_ID_TIM9                              144u
#define  BSP_PERIPH_ID_TIM10                             145u
#define  BSP_PERIPH_ID_TIM11                             146u
#define  BSP_PERIPH_ID_SPI5                              148u
#define  BSP_PERIPH_ID_SPI6                              149u
#define  BSP_PERIPH_ID_SAI1                              150u
#define  BSP_PERIPH_ID_LTDC                              154u

/*
*********************************************************************************************************
*                                           FUNCTION PROTOTYPES
*********************************************************************************************************
*/

void        BSP_Init                          (void);

void        BSP_IntDisAll                     (void);

CPU_INT32U  BSP_CPU_ClkFreq                   (void);

void        BSP_Tick_Init                     (void);

/*
*********************************************************************************************************
*                                           INTERRUPT SERVICES
*********************************************************************************************************
*/

