sevenchau/ONENET-ESP8266/hal_bsp/bsp_STMB997/bsp.h
void        BSP_IntInit                       (void);

void        BSP_IntEn                         (CPU_DATA       int_id);

void        BSP_IntDis                        (CPU_DATA       int_id);

void        BSP_IntClr                        (CPU_DATA       int_id);

void        BSP_IntVectSet                    (CPU_DATA       int_id,
                                               CPU_FNCT_VOID  isr);

void        BSP_IntPrioSet                    (CPU_DATA       int_id,
                                               CPU_INT08U     prio);

void         BSP_IntHandlerWWDG               (void);
void         BSP_IntHandlerPVD                (void);
void         BSP_IntHandlerTAMP_STAMP         (void);
void         BSP_IntHandlerRTC_WKUP           (void);
void         BSP_IntHandlerFLASH              (void);
void         BSP_IntHandlerRCC                (void);
void         BSP_IntHandlerEXTI0              (void);
void         BSP_IntHandlerEXTI1              (void);
void         BSP_IntHandlerEXTI2              (void);
void         BSP_IntHandlerEXTI3              (void);
void         BSP_IntHandlerEXTI4              (void);
void         BSP_IntHandlerDMA1_CH0           (void);
void         BSP_IntHandlerDMA1_CH1           (void);
void         BSP_IntHandlerDMA1_CH2           (void);
void         BSP_IntHandlerDMA1_CH3           (void);
void         BSP_IntHandlerDMA1_CH4           (void);
void         BSP_IntHandlerDMA1_CH5           (void);
void         BSP_IntHandlerDMA1_CH6           (void);
void         BSP_IntHandlerADC                (void);
void         BSP_IntHandlerCAN1_TX            (void);
void         BSP_IntHandlerCAN1_RX0           (void);
void         BSP_IntHandlerCAN1_RX1           (void);
void         BSP_IntHandlerCAN1_SCE           (void);
void         BSP_IntHandlerEXTI9_5            (void);
void         BSP_IntHandlerTIM1_BRK_TIM9      (void);
void         BSP_IntHandlerTIM1_UP_TIM10      (void);
void         BSP_IntHandlerTIM1_TRG_COM_TIM11 (void);
void         BSP_IntHandlerTIM1_CC            (void);
void         BSP_IntHandlerTIM2               (void);
void         BSP_IntHandlerTIM3               (void);
void         BSP_IntHandlerTIM4               (void);
void         BSP_IntHandlerI2C1_EV            (void);
void         BSP_IntHandlerI2C1_ER            (void);
void         BSP_IntHandlerI2C2_EV            (void);
void         BSP_IntHandlerI2C2_ER            (void);
void         BSP_IntHandlerSPI1               (void);
void         BSP_IntHandlerSPI2               (void);
void         BSP_IntHandlerUSART1             (void);
void         BSP_IntHandlerUSART2             (void);
void         BSP_IntHandlerUSART3             (void);
void         BSP_IntHandlerEXTI15_10          (void);
void         BSP_IntHandlerRTCAlarm           (void);
void         BSP_IntHandlerOTG_FS_WKUP        (void);
void         BSP_IntHandlerTIM8_BRK_TIM12     (void);
void         BSP_IntHandlerTIM8_UP_TIM13      (void);
void         BSP_IntHandlerTIM8_TRG_COM_TIM14 (void);
void         BSP_IntHandlerTIM8_CC            (void);
void         BSP_IntHandlerDMA1_STREAM7       (void);
void         BSP_IntHandlerFSMC               (void);
void         BSP_IntHandlerSDIO               (void);
void         BSP_IntHandlerTIM5               (void);
void         BSP_IntHandlerSPI3               (void);
void         BSP_IntHandlerUSART4             (void);
void         BSP_IntHandlerUSART5             (void);
void         BSP_IntHandlerTIM6_DAC           (void);
void         BSP_IntHandlerTIM7               (void);
void         BSP_IntHandlerDMA2_CH0           (void);
void         BSP_IntHandlerDMA2_CH1           (void);
void         BSP_IntHandlerDMA2_CH2           (void);
void         BSP_IntHandlerDMA2_CH3           (void);
void         BSP_IntHandlerDMA2_CH4           (void);
void         BSP_IntHandlerETH                (void);
void         BSP_IntHandlerETHWakeup          (void);
void         BSP_IntHandlerCAN2_TX            (void);
void         BSP_IntHandlerCAN2_RX0           (void);
void         BSP_IntHandlerCAN2_RX1           (void);
void         BSP_IntHandlerCAN2_SCE           (void);
void         BSP_IntHandlerOTG_FS             (void);
void         BSP_IntHandlerDMA2_CH5           (void);
void         BSP_IntHandlerDMA2_CH6           (void);
void         BSP_IntHandlerDMA2_CH7           (void);
void         BSP_IntHandlerUSART6             (void);
void         BSP_IntHandlerI2C3_EV            (void);
void         BSP_IntHandlerI2C3_ER            (void);
void         BSP_IntHandlerOTG_HS_EP1_OUT     (void);
void         BSP_IntHandlerOTG_HS_EP1_IN      (void);
void         BSP_IntHandlerOTG_HS_WKUP        (void);
void         BSP_IntHandlerOTG_HS             (void);
void         BSP_IntHandlerDCMI               (void);
void         BSP_IntHandlerCRYP               (void);
void         BSP_IntHandlerHASH_RNG           (void);
void         BSP_IntHandlerFPU                (void);
void         BSP_IntHandlerUART7              (void);
void         BSP_IntHandlerUART8              (void);
void         BSP_IntHandlerSPI4               (void);
void         BSP_IntHandlerSPI5               (void);
void         BSP_IntHandlerSPI6               (void);
void         BSP_IntHandlerSAI1               (void);
void         BSP_IntHandlerLTDC               (void);
void         BSP_IntHandlerLTDC_ER            (void);
void         BSP_IntHandlerDMA2D              (void);


/*
*********************************************************************************************************
*                                     PERIPHERAL POWER/CLOCK SERVICES
*********************************************************************************************************
*/

CPU_INT32U   BSP_PeriphClkFreqGet        (CPU_DATA       pwr_clk_id);

void         BSP_PeriphEn                (CPU_DATA       pwr_clk_id);

void         BSP_PeriphDis               (CPU_DATA       pwr_clk_id);

/*
*********************************************************************************************************
*                                             MODULE END
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                              LED SERVICES
*********************************************************************************************************
*/

#define IO_INIT(x,y)                   BSP_PERIPH_ID_##x,x,GPIO_Pin_##y
#define IO_CTR(x,y)                    x,GPIO_Pin_##y
extern void BSP_INFLOATIO_Init(CPU_DATA  pwr_clk_id, GPIO_TypeDef* gpio, uint16_t pin);
extern void BSP_OutPPIO_Init(CPU_DATA  pwr_clk_id, GPIO_TypeDef* gpio, uint16_t pin);
extern void BSP_IO_SetBits (GPIO_TypeDef* gpio, uint16_t pin);
extern void BSP_IO_ResetBits (GPIO_TypeDef* gpio, uint16_t pin);
extern void BSP_IO_Toggle (GPIO_TypeDef* gpio, uint16_t pin);
extern uint8_t BSP_IO_ReadInPutBit(GPIO_TypeDef* gpio, uint16_t pin);

extern void USART1_Init(uint32_t BaudRate, CPU_INT08U irq_pro, void (*rx_irq_cb)(uint16_t));
extern void USART2_Init(uint32_t BaudRate, CPU_INT08U irq_pro, void (*rx_irq_cb)(uint16_t));
extern void USART1_Send(uint8_t ch);
extern void USART2_Send(uint8_t ch);
extern void USART1_RxIrqCtl(FunctionalState NewState);
extern void USART2_RxIrqCtl(FunctionalState NewState);

#endif                                                          /* End of module include.                               */

